# messages.py

start_msg = "به بهترین ربات جهان خوش آمدید!"
help_msg = "راهنمایی ربات : lab lab lab lab"

add_source_msg = "لطفا آیدی کانال مبدا را ارسال کنید"
add_destination_msg = (
    "لطفا آیدی کانال مقصد را وارد کنید.\n"
    "توجه شود که ربات باید در این کانال ادمین باشد."
)

chapar_start_msg = "چاپار مشغول حمل پیام های شماست."
chapar_end_msg = "چاپار حمل پیام های شما را متوقف کرد:("

support_msg = "جهت ارتباط با پشتیبانی با آیدی زیر تماس بگیرید."

### Successful logs ###
success_msg       = "تبریک! چاپار شما ساخته شد."
add_source_done   = "کانال مبدا با موفقیت اضافه شد."
add_dest_done     = "کانال مقصد با موفقیت اضافه شد"

### Errors ###
error_add_source  = "اضافه کردن کانال مبدا با خطا مواجه شد"
error_add_dest    = "اضافه کردن کانال مقصد با خطا مواجه شد"
error_user_sub    = (
    "ربات در کانال مقصد اعلام شده ادمین نمی‌باشد. "
    "ابتدا دسترسی ادمین به ربات داده و سپس مجدداً تلاش کنید."
)

### Inline/interim ###
check_source      = "در حال بررسی کانال مبدا..."
check_dest_sub    = "در حال بررسی کانال مقصد..."
check_logs_msg    = "در حال بررسی گزارشات چاپار..."
