

START_MSG = "به بهترین ربات جهان خوش آمدید!"
HELP_MSG = "راهنمایی ربات : lab lab lab lab"

CHAPAR_START_MSG = "چاپار مشغول حمل پیام های شماست."
CHAPAR_END_MSG = "چاپار حمل پیام های شما را متوقف کرد:("

SUPPORT_MSG = "جهت ارتباط با پشتیبانی با آیدی زیر تماس بگیرید."

### Successful logs ###
SUCCESS_MSG       = "تبریک! چاپار شما ساخته شد."
ADD_SOURCE_DONE   = "کانال مبدا با موفقیت اضافه شد."
ADD_DEST_DONE     = "کانال مقصد با موفقیت اضافه شد"

### Errors ###
ERROR_ADD_SOURCE  = "اضافه کردن کانال مبدا با خطا مواجه شد"
ERROR_ADD_DEST    = "اضافه کردن کانال مقصد با خطا مواجه شد"
ERROR_USER_SUB    = (
    "ربات در کانال مقصد اعلام شده ادمین نمی‌باشد. "
    "ابتدا دسترسی ادمین به ربات داده و سپس مجدداً تلاش کنید."
)

### Inline/interim ###
CHECK_SOURCE      = "در حال بررسی کانال مبدا..."
CHECK_DEST_SUB    = "در حال بررسی کانال مقصد..."
CHECK_LOGS_MSG    = "در حال بررسی گزارشات چاپار..."
